#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/RobRoss/gh-actions-demo/runs/run-PA78ZWg3WA9CwTpv

Waiting for the plan to start...

Terraform v1.2.5
on linux_amd64
Initializing plugins and modules...
module.application.data.archive_file.function_package: Reading...
module.application.data.archive_file.function_package: Read complete after 0s [id=b9d0ddf04657ef6f1a547ca07ce3e028c9bb9b9b]
module.application.aws_api_gateway_rest_api.app_api: Refreshing state... [id=n2640vrdaa]
module.application.aws_api_gateway_integration.app_api_integration: Refreshing state... [id=agi-n2640vrdaa-ivrlp0-GET]
module.application.aws_api_gateway_resource.app_api_resource: Refreshing state... [id=ivrlp0]
module.application.data.aws_iam_policy_document.assume_role_policy_document: Reading...
module.application.aws_api_gateway_method.app_api_method: Refreshing state... [id=agm-n2640vrdaa-ivrlp0-GET]
module.application.data.aws_iam_policy_document.permissions_role_policy_document: Reading...
module.application.data.aws_iam_policy_document.assume_role_policy_document: Read complete after 0s [id=3693445097]
module.application.data.aws_iam_policy_document.permissions_role_policy_document: Read complete after 0s [id=4262981604]
module.application.aws_iam_role.lambda_role: Refreshing state... [id=lambda-role]
module.application.aws_iam_policy.permission_role_policy: Refreshing state... [id=arn:aws:iam::663729969216:policy/terraform-20220716153113943800000001]
module.application.aws_iam_policy_attachment.lambda_role_permissions_policy_attachment: Refreshing state... [id=lambda-role-permissions-policy-attachment]
module.application.aws_lambda_function.app_function: Refreshing state... [id=app-function]
module.application.aws_lambda_permission.app_api_permission: Refreshing state... [id=AllowExecutionFromAPIGateway]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.application.aws_api_gateway_integration.app_api_integration will be destroyed
  # (because aws_api_gateway_integration.app_api_integration is not in configuration)
  - resource "aws_api_gateway_integration" "app_api_integration" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "ivrlp0" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-n2640vrdaa-ivrlp0-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "ivrlp0" -> null
      - rest_api_id             = "n2640vrdaa" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:eu-west-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-1:663729969216:function:app-function/invocations" -> null
    }

  # module.application.aws_api_gateway_method.app_api_method will be destroyed
  # (because aws_api_gateway_method.app_api_method is not in configuration)
  - resource "aws_api_gateway_method" "app_api_method" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "GET" -> null
      - id                   = "agm-n2640vrdaa-ivrlp0-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "ivrlp0" -> null
      - rest_api_id          = "n2640vrdaa" -> null
    }

  # module.application.aws_api_gateway_resource.app_api_resource will be destroyed
  # (because aws_api_gateway_resource.app_api_resource is not in configuration)
  - resource "aws_api_gateway_resource" "app_api_resource" {
      - id          = "ivrlp0" -> null
      - parent_id   = "raugdjulab" -> null
      - path        = "/resource" -> null
      - path_part   = "resource" -> null
      - rest_api_id = "n2640vrdaa" -> null
    }

  # module.application.aws_api_gateway_rest_api.app_api will be destroyed
  # (because aws_api_gateway_rest_api.app_api is not in configuration)
  - resource "aws_api_gateway_rest_api" "app_api" {
      - api_key_source               = "HEADER" -> null
      - arn                          = "arn:aws:apigateway:eu-west-1::/restapis/n2640vrdaa" -> null
      - binary_media_types           = [] -> null
      - created_date                 = "2022-07-16T19:55:14Z" -> null
      - disable_execute_api_endpoint = false -> null
      - execution_arn                = "arn:aws:execute-api:eu-west-1:663729969216:n2640vrdaa" -> null
      - id                           = "n2640vrdaa" -> null
      - minimum_compression_size     = -1 -> null
      - name                         = "app-function-api" -> null
      - root_resource_id             = "raugdjulab" -> null
      - tags                         = {} -> null
      - tags_all                     = {} -> null

      - endpoint_configuration {
          - types            = [
              - "EDGE",
            ] -> null
          - vpc_endpoint_ids = [] -> null
        }
    }

  # module.application.aws_apigatewayv2_api.app_api will be created
  + resource "aws_apigatewayv2_api" "app_api" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "app-function-api"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)
      + target                       = "arn:aws:lambda:eu-west-1:663729969216:function:app-function"
    }

Plan: 1 to add, 0 to change, 4 to destroy.


```

</details>

*Pushed by: @Steven-Robinson, Action: `pull_request`*